Autodesk.Revit.DB.PartType
An enumerated type listing all MEP family part types. A part type typically provides one unique set of type parameters that defines this part.

Autodesk.Revit.DB.PartType.PipeMechanicalCoupling
Pipe Mechanical Coupling part type

Autodesk.Revit.DB.PartType.TopRails
Top Rails part type

Autodesk.Revit.DB.PartType.Handrails
Handrails part type

Autodesk.Revit.DB.PartType.Rails
Rails part type

Autodesk.Revit.DB.PartType.TerminationHardware
Termination Hardware part type

Autodesk.Revit.DB.PartType.PanelBracketHardware
Panel Bracket Hardware part type

Autodesk.Revit.DB.PartType.HandrailBracketHardware
Handrail Bracket Hardware part type

Autodesk.Revit.DB.PartType.EndCap
EndCap part type

Autodesk.Revit.DB.PartType.Sensor
Sensor part type

Autodesk.Revit.DB.PartType.InlineSensor
Inline Sensor part type

Autodesk.Revit.DB.PartType.LadderCableTrayMultiPort
Ladder CableTray MultiPort part type

Autodesk.Revit.DB.PartType.LadderCableTrayOffset
Ladder CableTray Offset part type

Autodesk.Revit.DB.PartType.LadderCableTrayUnion
Ladder CableTray Union part type

Autodesk.Revit.DB.PartType.LadderCableTrayTransition
Ladder CableTray Transition part type

Autodesk.Revit.DB.PartType.LadderCableTrayTee
Ladder CableTray Tee part type

Autodesk.Revit.DB.PartType.LadderCableTrayCross
Ladder CableTray Cross part type

Autodesk.Revit.DB.PartType.LadderCableTrayVerticalElbow
Ladder CableTray Vertical Elbow part type

Autodesk.Revit.DB.PartType.LadderCableTrayElbow
Ladder CableTray Elbow part type

Autodesk.Revit.DB.PartType.ChannelCableTrayMultiPort
Channel CableTray MultiPort part type

Autodesk.Revit.DB.PartType.ChannelCableTrayOffset
Channel CableTray Offset part type

Autodesk.Revit.DB.PartType.ChannelCableTrayUnion
Channel CableTray Union part type

Autodesk.Revit.DB.PartType.ChannelCableTrayTransition
Channel CableTray Transition part type

Autodesk.Revit.DB.PartType.ChannelCableTrayTee
Channel CableTray Tee part type

Autodesk.Revit.DB.PartType.ChannelCableTrayCross
Channel CableTray Cross part type

Autodesk.Revit.DB.PartType.ChannelCableTrayVerticalElbow
Channel CableTray Vertical Elbow part type

Autodesk.Revit.DB.PartType.ChannelCableTrayElbow
Channel CableTray Elbow part type

Autodesk.Revit.DB.PartType.JunctionBoxElbow
JunctionBox elbow part type

Autodesk.Revit.DB.PartType.PipeFlange
Pipe flange part type

Autodesk.Revit.DB.PartType.JunctionBoxCross
JunctionBox cross part type

Autodesk.Revit.DB.PartType.JunctionBoxTee
JunctionBox tee part type

Autodesk.Revit.DB.PartType.ValveNormal
Valve normal part type

Autodesk.Revit.DB.PartType.MultiPort
Multi port part type

Autodesk.Revit.DB.PartType.Pants
Pants part type

Autodesk.Revit.DB.PartType.LateralCross
Lateral cross part type

Autodesk.Revit.DB.PartType.LateralTee
Lateral tee part type

Autodesk.Revit.DB.PartType.Wye
Wye part type

Autodesk.Revit.DB.PartType.Damper
Damper part type

Autodesk.Revit.DB.PartType.SpudAdjustable
Spud adjustable part type

Autodesk.Revit.DB.PartType.SpudPerpendicular
Spud perpendicular part type

Autodesk.Revit.DB.PartType.ValveBreaksInto
Valve breaks into part type

Autodesk.Revit.DB.PartType.Switch
Switch part type

Autodesk.Revit.DB.PartType.EquipmentSwitch
Equipment switch part type

Autodesk.Revit.DB.PartType.OtherPanel
Other panel part type

Autodesk.Revit.DB.PartType.SwitchBoard
Switch board part type

Autodesk.Revit.DB.PartType.Transformer
Transformer part type

Autodesk.Revit.DB.PartType.PanelBoard
Panel board part type

Autodesk.Revit.DB.PartType.Union
Union part type

Autodesk.Revit.DB.PartType.Offset
Offset part type

Autodesk.Revit.DB.PartType.TapAdjustable
Tap adjustable part type

Autodesk.Revit.DB.PartType.TapPerpendicular
Tap perpendicular part type

Autodesk.Revit.DB.PartType.Cap
Cap part type

Autodesk.Revit.DB.PartType.Cross
Cross part type

Autodesk.Revit.DB.PartType.Transition
Transition part type

Autodesk.Revit.DB.PartType.Tee
Tee part type

Autodesk.Revit.DB.PartType.Elbow
Elbow part type

Autodesk.Revit.DB.PartType.BreaksInto
Breaks into part type

Autodesk.Revit.DB.PartType.AttachesTo
Attaches to part type

Autodesk.Revit.DB.PartType.JunctionBox
JunctionBox part type

Autodesk.Revit.DB.PartType.DuctMounted
Duct mounted part type

Autodesk.Revit.DB.PartType.Normal
Normal part type

Autodesk.Revit.DB.PartType.Undefined
Undefined part type